src/main/java/com/amdocs/halo/automation/xmls/CNOD_PTP.xml

<!--edited with XMLSPY v2004 rel. 4 U (http://www.xmlspy.com) by user user (Amdocs Management UK)-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cus="http://CustomerOrderEstablishment.ocxGenericServices.services.amdocs.com">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-1">
            <wsse:Username>OMS</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Oms111</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <cus:createProductOrderForNewProduct>
         <createProductOrderForNewProductRequest>
            <salesChannel>SA</salesChannel>
            <options>
               <confirmationChecksApproved>true</confirmationChecksApproved>
            </options>
            <order>
               <!--Optional:-->
               <userId>g31791</userId>
               <customer>
                  <contractId>AT1706</contractId>
                  <customerId>8390000001706</customerId>
                  <customerName>AMDOCS1706</customerName>
                  <customerType>CORP</customerType>
                  <organizationId>123459006</organizationId>
                  <saartId>ABCD1706</saartId>
               </customer>
               <description>Using update Add Product to offer.</description>
               <externalId>Winroom_TXTXH_3434</externalId>
               <productOfferings>
                  <productOfferingId>7201</productOfferingId>
                  <topLevelProducts>
                     <associationSpec>
                        <productSpecsId>1981</productSpecsId>
                     </associationSpec>
                     <orderItem>
                        <contacts>
                           <contactType>CUS</contactType>
                           <email>hs1650@att.com</email>
                           <firstName>Harmesh</firstName>
                           <landLinePhone>7736878847</landLinePhone>
                           <lastName>Saluja</lastName>
                           <mobilePhone>9856987747</mobilePhone>
                        </contacts>
                        <orderActionType>PR</orderActionType>
                        <orderItemAttributes>
                           <notes>PROVIDE</notes>
                        </orderItemAttributes>
                        <serviceRequiredDate>2019-05-03T20:59:59+02:00</serviceRequiredDate>
                     </orderItem>
                     <topLevelProduct>
                        <containedProducts>
                           <action>CHANGE</action>
                           <associationSpecDefinition>
                              <componentServiceType>EVCA</componentServiceType>
                           </associationSpecDefinition>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>EnhancedMulticast</attributeCode>
                              </characteristicDefinition>
                              <value>N</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>CIRSpeed</attributeCode>
                              </characteristicDefinition>
                              <value>10</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>ClassofService</attributeCode>
                              </characteristicDefinition>
                              <value>10</value>
                           </characteristicValues>
                          <!--adxValue EVCA A-->
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>MACAddressLimit</attributeCode>
                              </characteristicDefinition>
                              <value>N</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>CVLANTAG</attributeCode>
                              </characteristicDefinition>
                              <value>519</value>
                           </characteristicValues>
                        </containedProducts>
                        <containedProducts>
                           <action>CHANGE</action>
                           <associationSpecDefinition>
                              <componentServiceType>PLNK</componentServiceType>
                           </associationSpecDefinition>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>portTypeLink</attributeCode>
                              </characteristicDefinition>
                              <value>SDN</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>PortCircuitID</attributeCode>
                              </characteristicDefinition>
                              <value>{$circuitIdA$}</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>ppuAddress</attributeCode>
                                 <attributeId>6039715</attributeId>
                              </characteristicDefinition>
                              <value>200 Laurel Ave South, Room 1 Floor 2, Middletwon, NJ, Zip 07748</value>
                           </characteristicValues>
                        </containedProducts>
                     </topLevelProduct>
                  </topLevelProducts>
                  <topLevelProducts>
                     <associationSpec>
                        <productSpecsId>1981</productSpecsId>
                     </associationSpec>
                     <orderItem>
                        <contacts>
                           <contactType>CUS</contactType>
                           <email>hs1650@att.com</email>
                           <firstName>Harmesh</firstName>
                           <landLinePhone>7736878847</landLinePhone>
                           <lastName>Saluja</lastName>
                           <mobilePhone>9856987747</mobilePhone>
                        </contacts>
                        <orderActionType>PR</orderActionType>
                        <orderItemAttributes>
                           <notes>PROVIDE</notes>
                        </orderItemAttributes>
                        <serviceRequiredDate>2019-05-03T20:59:59+02:00</serviceRequiredDate>
                     </orderItem>
                     <topLevelProduct>
                        <containedProducts>
                           <action>CHANGE</action>
                           <associationSpecDefinition>
                              <componentServiceType>EVCA</componentServiceType>
                           </associationSpecDefinition>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>EnhancedMulticast</attributeCode>
                              </characteristicDefinition>
                              <value>N</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>CIRSpeed</attributeCode>
                              </characteristicDefinition>
                              <value>10</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>ClassofService</attributeCode>
                              </characteristicDefinition>
                              <value>10</value>
                           </characteristicValues>
                           <!--adxValue EVCA B-->
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>MACAddressLimit</attributeCode>
                              </characteristicDefinition>
                              <value>N</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>CVLANTAG</attributeCode>
                              </characteristicDefinition>
                              <value>620</value>
                           </characteristicValues>
                        </containedProducts>
                        <containedProducts>
                           <action>CHANGE</action>
                           <associationSpecDefinition>
                              <componentServiceType>PLNK</componentServiceType>
                           </associationSpecDefinition>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>portTypeLink</attributeCode>
                              </characteristicDefinition>
                              <value>SDN</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>PortCircuitID</attributeCode>
                              </characteristicDefinition>
                              <value>{$circuitIdB$}</value>
                           </characteristicValues>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>ppuAddress</attributeCode>
                                 <attributeId>6039715</attributeId>
                              </characteristicDefinition>
                              <value>200 Laurel Ave South, Room 1 Floor 2, Middletwon, NJ, Zip 07748</value>
                           </characteristicValues>
                        </containedProducts>
                     </topLevelProduct>
                  </topLevelProducts>
                  <topLevelProducts>
                     <associationSpec>
                        <productSpecsId>2131</productSpecsId>
                     </associationSpec>
                     <orderItem>
                        <contacts>
                           <contactType>CUS</contactType>
                           <email>hs1650@att.com</email>
                           <firstName>Deva</firstName>
                           <landLinePhone>7736878847458</landLinePhone>
                           <lastName>S</lastName>
                           <mobilePhone>9856987747</mobilePhone>
                        </contacts>
                        <serviceAdddress>
                           <state>IL</state>
                        </serviceAdddress>
                        <orderActionType>PR</orderActionType>
                        <orderItemAttributes>
                           <notes>PROVIDE</notes>
                        </orderItemAttributes>
                        <serviceRequiredDate>2019-05-03T20:59:59+02:00</serviceRequiredDate>
                     </orderItem>
                     <topLevelProduct>
                        <containedProducts>
                           <action>CHANGE</action>
                           <associationSpecDefinition>
                              <componentServiceType>EVCV</componentServiceType>
                           </associationSpecDefinition>
                           <characteristicValues>
                              <characteristicDefinition>
                                 <attributeCode>EVCTopology</attributeCode>
                              </characteristicDefinition>
                              <value>PTP</value>
                           </characteristicValues>
                             <!--adxValue EVCV-->
                        </containedProducts>
                     </topLevelProduct>
                  </topLevelProducts>
               </productOfferings>
               <startOrderingProcess>true</startOrderingProcess>
            </order>
         </createProductOrderForNewProductRequest>
      </cus:createProductOrderForNewProduct>
   </soapenv:Body>
</soapenv:Envelope>